In [1]:
import findspark
findspark.init()
import pyspark

In [ ]:
import databricks.koalas as pd
#precisa ser python >= 3.5 ou <3.10

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('dados/Churn.csv', sep=';')

In [4]:
df.head(3)

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,619,France,Female,42,2,0,1,1,1,10134888,1
1,608,Spain,Female,41,1,8380786,1,0,1,11254258,0
2,502,France,Female,42,8,1596608,3,1,0,11393157,1

In [5]:
df.iloc[1:4,0:4]

   CreditScore Geography  Gender  Age
1          608     Spain  Female   41
2          502    France  Female   42
3          699    France  Female   39

In [6]:
df['CreditScore'].describe()

count    10000.000000
mean       650.528800
std         96.653299
min        350.000000
25%        584.000000
50%        652.000000
75%        718.000000
max        850.000000
Name: CreditScore, dtype: float64

In [7]:
agrupado = df.groupby(['Geography']).size()
print(agrupado)

Geography
France     5014
Germany    2509
Spain      2477
dtype: int64